var knowledge=[
    {
        que:"色彩的三原色是？",
        ans:["A.红、绿、蓝","B.红、黄、绿","C.红、黄、蓝","D.橙、紫、绿"],
        right:2
    },
    {
        que:"色光的三原色是？",
        ans:["A.红、绿、蓝","B.红、黄、绿","C.红、黄、蓝","D.橙、紫、绿"],
        right:0
    },
    {
        que:"色彩的三要素是？",
        ans:["A.暗度、明度、灰度","B.色相、明度、纯度","C.饱和度、亮度、暗度","D.色调、暖度、灰度"],
        right:1
    },
    {
        que:"下面属于暖色调的是？",
        ans:["A.绿","B.黄","C.青","D.蓝"],
        right:1
    },
    {
        que:"CMYK表色法是减色表色模式，遵循色料混合规律。C、M、Y、K表示印刷中的( )四种原色。",
        ans:["A.红、绿、蓝、黄","B.中黄、桃红、天蓝、黑","C.红、黄、蓝、黑","D.青、品红、黄、黑"],
        right:3
    },
    {
        que:"下列颜色不构成互补色的是",
        ans:["A.品红和绿","B.品红和黄","C.青和红","D.黄和蓝"],
        right:1
    },
    {
        que:"色觉的三要素是光、呈现颜色的物体、正常的视察觉器官。",
        ans:["A.对","B.错"],
        right:0
    },
    {
        que:"三原色等量混合呈",
        ans:["A.黑光","B.白光","C.紫光","D.黄光"],
        right:1
    },
    {
        que:"CMYK颜色空间的色域要( )RGB颜色空间。",
        ans:["A.大于","B.等于","C.小于"],
        right:2
    },
    {
        que:"CMYK和RGB空间所覆盖的颜色范围完全一致。",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"色光相加，能量增加，越加越暗。",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"色彩的明度发生变化时，饱和度不变化。",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"色是( )刺激人的视觉器官后所产生的一种生理感觉。",
        ans:["A.光","B.颜色","C. 颜料"],
        right:0
    },
    {
        que:"光源的色温表示的是",
        ans:["A.光源的温度","B.颜色的特性","C. 颜色的温度","D.色光的温度"],
        right:1
    },
    {
        que:"彩色是指在视觉中有( )的颜色。",
        ans:["A.明度","B.色相","C. 饱和度","D.明度与饱和度"],
        right:1
    },
    {
        que:"在色光三原色红、绿、蓝中，最亮最纯的颜色是( )",
        ans:["A.红","B.绿","C.蓝"],
        right:1
    },
    {
        que:"消色是指( )。",
        ans:["A.自然界的所有色 ","B.黑白色","C.黑、白及各种灰色","D.消灭颜色"],
        right:2
    },
    {
        que:"人眼所感受到的色彩的明暗程度称为饱和度。",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"原色是可混合生成所有其它色的三基色。其中加色混合色为",
        ans:["A.红、黄、蓝 ","B.黄、品红、蓝","C.红、绿、蓝","D.黄、品红、青"],
        right:2
    },
    {
        que:"CMYK 颜色空间是印刷油墨形成的色空间。",
        ans:["A.对","B.错"],
        right:0
    },
    {
        que:"消色是指除了光谱以外的所有其他颜色。",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"任何一种彩色均可用色相、明度和饱和度三个量化指标表示。",
        ans:["A.对","B.错"],
        right:0
    },
    {
        que:"自然界的日光，以及人造光源如日光灯、白炽灯、镝灯所发出的光都是",
        ans:["A.复色光","B.单色光无色光","C.无色光","D.白光"],
        right:0
    },
    {
        que:"白色物体是个例外，它不受光源色的影响，因为所有色光照射到白色物体上，都会被它不加选择地统统吸收。",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"彩色物体形成的颜色是由( )所决定的。",
        ans:["A.光谱的不同波长被等量吸收","B.光谱的不同波长全部吸收","C.光谱对不同波长的选择吸收","D.光谱的所有波长均未被吸收"],
        right:2
    },
    {
        que:"人眼睛的明适应和暗适应时间大致是",
        ans:["A.明适应时间快","B.暗适应时间快","C.两个一样"],
        right:0
    },
    {
        que:"颜色的明度高低是由物体表面的( )大小来表示的。",
        ans:["A.光谱分布率","B.光的波长","C.光的反射","D.光的反射率"],
        right:3
    },
    {
        que:"补色是加色混合后成( )的两个互补色光。",
        ans:["A.黑色或灰色","B.白色或灰色","C.黑色","D.白色"],
        right:1
    },
    {
        que:"彩色电视机中彩色图像的形成是( )加色混合的结果",
        ans:["A.视觉器官内","B.视觉器官外","C.色光","D.色料"],
        right:2
    },
    {
        que:"( )不是呈色原理是色料减色法原理",
        ans:["A.彩色电视","B.彩色印刷","C.彩色印染","D.彩色摄影"],
        right:0
    },
    {
        que:"色彩是一种感觉，它是光作用于人的视觉器官并在大脑中引起的反映。",
        ans:["A.对","B.错"],
        right:0
    },
    {
        que:"光源的色温与光源的颜色关系为，色温越高，光越偏蓝；色温越低，光越偏红。",
        ans:["A.对","B.错"],
        right:0
    },
    {
        que:"彩色油墨的调配遵守色光加色的原理。",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"加色法是按黄、品红、青三原色料的加色混合原理生成新的颜色方法。",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"由于印刷品上反射的色光在到达人眼时，产生了加色效应，引起了明度的变化。",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"补色是减色混合成黑色或灰色的两个互补色料，色光没有补色",
        ans:["A.对","B.错"],
        right:1
    },
    {
        que:"可见光入射到品红墨层后，墨层吸收了绿光，反射了红光和蓝光，根据R+B=M，使人眼看到了品红光(M)。",
        ans:["A.对","B.错"],
        right:0
    }
];